# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, stems, [24, 3, 2]]  # 0-P1/2
  - [-1, 2, FusedMBConv, [24, 3, 1, 1, 0]] # 1-p2/4
  - [-1, 1, FusedMBConv, [48, 3, 2, 4, 0]] # 2
  - [-1, 3, FusedMBConv, [48, 3, 1, 4, 0]] # 3
  - [-1, 1, FusedMBConv, [64, 3, 2, 4, 0]] # 4
  - [-1, 3, FusedMBConv, [64, 3, 1, 4, 0]] # 5
  - [-1, 1, MBConv, [128, 3, 2, 4]] # 6
  - [-1, 5, MBConv, [128, 3, 1, 4]] # 7
  - [-1, 1, MBConv, [160, 3, 2, 6]] # 8
  - [-1, 8, MBConv, [160, 3, 1, 6]] # 9
  - [-1, 1, MBConv, [256, 3, 2, 4]] # 10
  - [-1, 14, MBConv, [256, 3, 1, 4]] # 11
  - [-1, 1, SPPF, [1024, 5]]  # 12
  - [-1, 1, CBAM, [1024]] # 13

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 22 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True, True]] # 25 (P5/32-large)

  - [[19, 22, 25], 1, v10Detect, [nc]] # Detect(P3, P4, P5)


